first_routes_proj/app/controllers/likes_controller.rb

INSERT INTO "likes" ("liker_id", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["liker_id", 1], ["likeable_type", "Artwork"], ["likeable_id", 1], ["created_at", "2023-01-13 01:08:11.580840"], ["updated_at", "2023-01-13 01:08:11.580840"]]
---
    def create
        like = Like.new(like_params)
        if like.save