first_routes_proj/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "Stephen"]]
---
    def index
        # users = User.where(username: params[:username])
        # render json: users

        # debugger
        if params[:username]
            render json: User.where(username: params[:username])

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "stephen"], ["email", "stephenmdwong@gmail.com"], ["created_at", "2023-01-11 10:49:23.760078"], ["updated_at", "2023-01-11 10:49:23.760078"]]
---
    def create
        # debugger
        user = User.new(user_params)
        if user.save